In [1]:
import numpy as np
import itertools
import pandas as pd 
from itertools import product
import random
from six.moves import cPickle as pickle

import gc


# data_root = "C:\\Users\\Tigran PC\\Desktop\\MicrobiomicsData\\data\\" # notebook
# data_root = "/Users/tigran/Desktop/sbv/data/" # imac
data_root = "C:\\Users\\Administrator\\Repos\\Microbiomics\\data\\" # server

In [2]:
def make_sub_seq_bank(initial_string, sub_seq_len):
    return [''.join(tup) for tup in  list(set(product(set(initial_string), repeat = sub_seq_len)))]

    
def convert_read_to_numb(dataframe, sub_str_len):
    ss_bank =  make_sub_seq_bank("ATCG", sub_str_len)
    data_list = []
    for seq in dataframe.values:
        sub_seq_count = []
        for ss in ss_bank:
            sub_seq_count.append(seq[0].count(ss))
        sub_seq_count.append(seq[1])      
        data_list.append(sub_seq_count)
    return pd.DataFrame(data_list, columns=ss_bank.append("lable"))

In [3]:
df1 = pd.read_pickle(data_root + "DNA_data1.pickle")

In [4]:
df2 = pd.read_pickle(data_root + "DNA_data2.pickle")

In [5]:
print(df1.shape)
print(df2.shape)
df = pd.concat([df1, df2]) 
del df1, df2
df.head()

(39341870, 2)
(39389753, 2)

                                                   0    lable
0  TTACGACACCTGGTCGACGGTGTACAACCAGCTCGAGGGCACTTGG...     1768
1  GAACGGCCGCAGCTCGTCGATCACCCCGGTCAGCGCCCGCGTCTCC...  1751294
2  AGCCTATATTAAATTGCTACCGCCTGAAAAACGAGGAGCGGAGAAC...   189834
3  TGGTATTTCTCTGTATCAAAATTGGCGTTTTGATAATAATACGGGA...  1954172
4  GTAAAGGTCAGTACGGCCACGTGGTCTTCACGCTCGAACCATTGCC...   741091

In [6]:
print(df.shape)
df.head()

(78731623, 2)

                                                   0    lable
0  TTACGACACCTGGTCGACGGTGTACAACCAGCTCGAGGGCACTTGG...     1768
1  GAACGGCCGCAGCTCGTCGATCACCCCGGTCAGCGCCCGCGTCTCC...  1751294
2  AGCCTATATTAAATTGCTACCGCCTGAAAAACGAGGAGCGGAGAAC...   189834
3  TGGTATTTCTCTGTATCAAAATTGGCGTTTTGATAATAATACGGGA...  1954172
4  GTAAAGGTCAGTACGGCCACGTGGTCTTCACGCTCGAACCATTGCC...   741091

In [25]:
step = 60000000

In [26]:
df_s = pd.DataFrame(df.values[50000000:step, :])

In [27]:
df_s.head()

                                                   0        1
0  TGTAAGATGAAGGAAGTGGTAAAATGGATGGTAATCATTACCGCGA...  1156431
1  ATCCTCCTATATCCTGAAAAAGTTATTTGGGATGTGGGCGGTTTGC...     1408
2  AAACTATTAATATCGCTGTTTCTCCAGAATACAAAAAGATTGTTTC...   313598
3  CCCCAGAGATCTACTCCGAGATGATCGACCGCGCTAAGACGGGCGG...  1849032
4  GGTGGGATTGTCCCGAGCAACCTTCTTCGCGGCATGTGCGCGAAGG...   161895

### Convert to numbers

In [28]:
gc.collect()
df_s.shape

(10000000, 2)

In [ ]:
%time df_s =  convert_read_to_numb(df_s, 4)

In [ ]:
df_s.head(10)

In [ ]:
columns = list(df_s.columns.values)
print(type(columns))
df_s = df_s.sample(frac=1).reset_index(drop=True)
print(df_s.shape)
df_s = df_s.drop_duplicates(subset=columns[:-1])
print(df_s.shape)

In [ ]:
df_s.tail()

In [ ]:
pickle_file = data_root + "F_Bank_6.pickle"

try:   
    f = open(pickle_file, 'wb')
    pickle.dump(df_s, f, pickle.HIGHEST_PROTOCOL)
    f.close()
except Exception as e:
    print('Unable to save data to', pickle_file, ':', e)
    raise